<template>
  <div class="mt-5 pt-5">
    <dashed-title classList="font-demi mt-3" dashedSide="left">
      نظرات کاربران
    </dashed-title>
    <div class="row comments-container" >
      <div v-for="index in 3" :key="index" class="col-4">
        <div class="comments-box p-4 mb-4" v-for="i in 3" :key="i">
          <div class="d-flex gap-3 align-items-center">
            <span class="img-box">
              <img src="/img/icons/user-photo2.png" alt="">
              <a href="" class="d-flex align-items-center justify-content-center">
                <svg width="17" height="17" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M4.08307 11.2292V6.5625C4.08307 6.27194 4.08307 6.12666 4.0531 6.00702C3.96344 5.64909 3.68397 5.36962 3.32605 5.27997C3.20641 5.25 3.06113 5.25 2.77057 5.25C2.48001 5.25 2.33473 5.25 2.21509 5.27997C1.85716 5.36962 1.57769 5.64909 1.48804 6.00702C1.45807 6.12666 1.45807 6.27194 1.45807 6.5625V11.2292C1.45807 11.5197 1.45807 11.665 1.48804 11.7846C1.57769 12.1426 1.85716 12.422 2.21509 12.5117C2.33473 12.5417 2.48001 12.5417 2.77057 12.5417C3.06113 12.5417 3.20641 12.5417 3.32605 12.5117C3.68397 12.422 3.96344 12.1426 4.0531 11.7846C4.08307 11.665 4.08307 11.5197 4.08307 11.2292Z" fill="white"/>
                  <path d="M4.08307 2.77083C4.08307 3.49571 3.49544 4.08333 2.77057 4.08333C2.0457 4.08333 1.45807 3.49571 1.45807 2.77083C1.45807 2.04596 2.0457 1.45833 2.77057 1.45833C3.49544 1.45833 4.08307 2.04596 4.08307 2.77083Z" fill="white"/>
                  <path d="M6.89828 5.25H6.41642C5.86645 5.25 5.59146 5.25 5.42061 5.42085C5.24976 5.59171 5.24976 5.86669 5.24976 6.41667V11.375C5.24976 11.925 5.24976 12.2 5.42061 12.3708C5.59146 12.5417 5.86645 12.5417 6.41642 12.5417H6.7081C7.25807 12.5417 7.53305 12.5417 7.70391 12.3708C7.87476 12.2 7.87476 11.925 7.87477 11.375L7.87479 9.3334C7.87479 8.3669 8.18282 7.5834 9.09268 7.5834C9.54761 7.5834 9.9164 7.97515 9.9164 8.4584V11.0834C9.9164 11.6334 9.9164 11.9084 10.0873 12.0792C10.2581 12.2501 10.5331 12.2501 11.0831 12.2501H11.374C11.9239 12.2501 12.1988 12.2501 12.3696 12.0793C12.5405 11.9085 12.5405 11.6335 12.5407 11.0837L12.5415 7.87514C12.5415 6.42539 11.1626 5.25014 9.79786 5.25014C9.02096 5.25014 8.3278 5.63097 7.87479 6.22647C7.87478 5.85896 7.87477 5.67521 7.79493 5.53875C7.74437 5.45234 7.67242 5.38039 7.58601 5.32984C7.44955 5.25 7.26579 5.25 6.89828 5.25Z" fill="white"/>
                </svg>
              </a>
            </span>
            <span class="d-flex flex-column p-size w-100">
              <span class="h5-size font-demi pb-2">
                امیررضا باقری
              </span>
              <span class="d-flex justify-content-between align-items-center w-100">
                ۲ دی ۱۴۰۱
                <span class="pr-1">
                  ۴.۸
                  <svg width="18" height="18" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M7.9974 0.833328C8.69691 0.833328 9.24792 1.36168 9.59969 2.0746L10.7744 4.44344C10.81 4.51675 10.8944 4.61998 11.0214 4.71442C11.1482 4.80876 11.2724 4.8608 11.3541 4.87453L13.4805 5.23075C14.2486 5.35982 14.8924 5.73632 15.1014 6.39193C15.3102 7.04699 15.0042 7.72773 14.4519 8.28109L14.4514 8.28163L12.7994 9.94723C12.7339 10.0132 12.6606 10.1376 12.6146 10.2996C12.5689 10.4605 12.5649 10.6071 12.5856 10.7018L12.5859 10.7031L13.0585 12.7636C13.2545 13.6212 13.1896 14.4715 12.5847 14.9161C11.9778 15.3622 11.1485 15.1645 10.395 14.7157L8.4017 13.526C8.318 13.476 8.17424 13.4355 8.00073 13.4355C7.82849 13.4355 7.68171 13.4755 7.59256 13.5273L7.5913 13.5281L5.60192 14.7155C4.84937 15.1658 4.02103 15.36 3.41407 14.9135C2.80966 14.4688 2.74143 13.62 2.93807 12.7631L3.4106 10.7031L3.41089 10.7018C3.43161 10.6071 3.42755 10.4605 3.38187 10.2996C3.33587 10.1376 3.26252 10.0132 3.19705 9.94723L1.5439 8.28042C0.995098 7.72708 0.690138 7.04693 0.897298 6.39283C1.10506 5.73682 1.74762 5.35986 2.51622 5.2307L4.64088 4.87479L4.64156 4.87467C4.71945 4.86116 4.8418 4.8097 4.96832 4.71512C5.09507 4.62036 5.17973 4.5169 5.21541 4.44344L5.21721 4.43977L6.39041 2.07398L6.39088 2.07304C6.74597 1.36071 7.29869 0.833328 7.9974 0.833328Z" fill="#DE8208"/>
                  </svg>
                </span>
              </span>
            </span>
          </div>
          <p v-if="i === 1 && index === 2" class="mt-3 pt-2 opacity-700">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
          </p>
          <p v-else class="mt-3 pt-2 opacity-700">
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import dashedTitle from '../particles/dashedTitleComments.vue'
  export default {
  components: { dashedTitle },

  }
</script>

<style lang="scss" scoped>
.comments-container{
  .comments-box{
    background: $bg-color;
    border-radius: 16px;
    >p{
      line-height: $h2-size;
    }
    .img-box{
      position: relative;
      img{
        width: 100px;
        height: 100px;
        object-fit: cover;
        border-radius: 16px;
      }
      a{
        position: absolute;
        background: $dark-color;
        width: 40px;
        height: 40px;
        bottom: 0;
        right: 0;
        transform: translate(9px , 13px);
        border-radius: 50%;
        border: 3px solid $light-300;
        outline: 6px solid $bg-color;
        svg{
          transform: translateY(-2px);
        }
      }
    }
  }
}
</style>
