<template>
  <div class="mt-5 pt-5">
    <dashed-title classList="font-demi" dashedSide="left">
      آشنایی با دوره الگوهای طراحی حرفه ای
    </dashed-title>
    <p class="mt-4 pt-2 opacity-700">
      اولین تسک فنی (یک مسئله) من در یک شرکت بزرگ که به عنوان برنامه نویس Backend در اون مشغول به کار شده بودم، مسئله ای بود که در نگاه اول بسیار عجیب و غریب به نظر می‌رسید و یک راه حل عجیب و غریب هم براش در نظر گرفته بودن.
      داستان از این قرار بود که در نرم افزار شرکت از یک پکیج برای ثبت نام و لاگین کاربر با استفاده از یاهو و گوگل استفاده شده بود و مشکلی که این پکیج داشت این بود که اگر کاربری اکانت یاهو داشت آدرس جی میل خودش رو به عنوان آدرس اصلی یا Primary ثبت میکرد، همون آدرس به برگشت داده میشد و عملا ما کاربری داشتیم که با یاهو ثبت نام کرده اما آدرس ایمیلش به جای @yahoo.com با @gmail.com تموم میشد.
      تیم محصول تاکید داشتن کاربر یاهو حتما باید آدرس ایمیل یاهو ازشون گرفته بشه و تیم فنی برای حل این مساله شروع کرده بود به بررسی کدهای اون پکیج. اما راه حل چی بود؟ تیم فنی تصمیم گرفته بود اون کلاسی که مسئول دریافت آدرس ایمیل‌های کاربران هست رو داخل خود پکیج تغییربده و عملا پکیج رو مجبور کنه که برای کاربران یاهو آدرس یاهو رو برگردونه.
    </p>
  </div>
</template>

<script>
import dashedTitle from '../particles/dashedTitle.vue'
export default {
  components: { dashedTitle },

}
</script>

<style lang="scss" scoped>
p{
  line-height: $h2-size;
}
</style>
